soap-producer/src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:gs="http://spring.io/guides/gs-producing-web-service">
	<soapenv:Header />
	<soapenv:Body>
		<gs:getCountryRequest>
			<gs:name>Spain</gs:name>
		</gs:getCountryRequest>
	</soapenv:Body>
</soapenv:Envelope>
<!-- curl - - header "content-type: text/xml" -d @request.xml http://localhost:8000/ws -->